[Killed] BlockStatement
Documentos/scoringBowling/src/game.ts:5:20
   private rolls: number[] = Array(21).fill(0)
   private currentRoll: number = 0
 
-  score (): number {
-    let score = 0
-    let frameIndex = 0
-    for (let frame = 0; frame < 10; frame++) {
-      if (this.isStrike(frameIndex)) {
-        score += 10 + this.strikeBonus(frameIndex)
-        frameIndex++
-      } else if (this.isSpare(frameIndex)) {
-        score += 10 + this.spareBonus(frameIndex)
-        frameIndex += 2
-      } else {
-        score += this.sumOfBallsInFrame(frameIndex)
-        frameIndex += 2
-      }
-    }
-    return score
-  }
+  score (): number {}
 
   private sumOfBallsInFrame (frameIndex: number): number {

[Killed] EqualityOperator
Documentos/scoringBowling/src/game.ts:8:31
   score (): number {
     let score = 0
     let frameIndex = 0
-    for (let frame = 0; frame < 10; frame++) {
+    for (let frame = 0; frame >= 10; frame++) {
       if (this.isStrike(frameIndex)) {
         score += 10 + this.strikeBonus(frameIndex)

[Killed] EqualityOperator
Documentos/scoringBowling/src/game.ts:8:31
   score (): number {
     let score = 0
     let frameIndex = 0
-    for (let frame = 0; frame < 10; frame++) {
+    for (let frame = 0; frame <= 10; frame++) {
       if (this.isStrike(frameIndex)) {
         score += 10 + this.strikeBonus(frameIndex)

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:9:11
     let score = 0
     let frameIndex = 0
     for (let frame = 0; frame < 10; frame++) {
-      if (this.isStrike(frameIndex)) {
+      if (true) {
         score += 10 + this.strikeBonus(frameIndex)
         frameIndex++

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:9:11
     let score = 0
     let frameIndex = 0
     for (let frame = 0; frame < 10; frame++) {
-      if (this.isStrike(frameIndex)) {
+      if (false) {
         score += 10 + this.strikeBonus(frameIndex)
         frameIndex++

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:10:9
     let frameIndex = 0
     for (let frame = 0; frame < 10; frame++) {
       if (this.isStrike(frameIndex)) {
-        score += 10 + this.strikeBonus(frameIndex)
+        false
         frameIndex++
       } else if (this.isSpare(frameIndex)) {

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:10:9
     let frameIndex = 0
     for (let frame = 0; frame < 10; frame++) {
       if (this.isStrike(frameIndex)) {
-        score += 10 + this.strikeBonus(frameIndex)
+        true
         frameIndex++
       } else if (this.isSpare(frameIndex)) {

[Killed] UpdateOperator
Documentos/scoringBowling/src/game.ts:11:9
     for (let frame = 0; frame < 10; frame++) {
       if (this.isStrike(frameIndex)) {
         score += 10 + this.strikeBonus(frameIndex)
-        frameIndex++
+        frameIndex--
       } else if (this.isSpare(frameIndex)) {
         score += 10 + this.spareBonus(frameIndex)

[Killed] BlockStatement
Documentos/scoringBowling/src/game.ts:12:44
       if (this.isStrike(frameIndex)) {
         score += 10 + this.strikeBonus(frameIndex)
         frameIndex++
-      } else if (this.isSpare(frameIndex)) {
-        score += 10 + this.spareBonus(frameIndex)
-        frameIndex += 2
-      } else {
+      } else if (this.isSpare(frameIndex)) {} else {
         score += this.sumOfBallsInFrame(frameIndex)
         frameIndex += 2

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:12:18
       if (this.isStrike(frameIndex)) {
         score += 10 + this.strikeBonus(frameIndex)
         frameIndex++
-      } else if (this.isSpare(frameIndex)) {
+      } else if (false) {
         score += 10 + this.spareBonus(frameIndex)
         frameIndex += 2

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:13:9
         score += 10 + this.strikeBonus(frameIndex)
         frameIndex++
       } else if (this.isSpare(frameIndex)) {
-        score += 10 + this.spareBonus(frameIndex)
+        true
         frameIndex += 2
       } else {

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:13:9
         score += 10 + this.strikeBonus(frameIndex)
         frameIndex++
       } else if (this.isSpare(frameIndex)) {
-        score += 10 + this.spareBonus(frameIndex)
+        false
         frameIndex += 2
       } else {

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:14:9
         frameIndex++
       } else if (this.isSpare(frameIndex)) {
         score += 10 + this.spareBonus(frameIndex)
-        frameIndex += 2
+        true
       } else {
         score += this.sumOfBallsInFrame(frameIndex)

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:14:9
         frameIndex++
       } else if (this.isSpare(frameIndex)) {
         score += 10 + this.spareBonus(frameIndex)
-        frameIndex += 2
+        false
       } else {
         score += this.sumOfBallsInFrame(frameIndex)

[Killed] BlockStatement
Documentos/scoringBowling/src/game.ts:15:14
       } else if (this.isSpare(frameIndex)) {
         score += 10 + this.spareBonus(frameIndex)
         frameIndex += 2
-      } else {
-        score += this.sumOfBallsInFrame(frameIndex)
-        frameIndex += 2
-      }
+      } else {}
     }
     return score

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:16:9
         score += 10 + this.spareBonus(frameIndex)
         frameIndex += 2
       } else {
-        score += this.sumOfBallsInFrame(frameIndex)
+        true
         frameIndex += 2
       }

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:16:9
         score += 10 + this.spareBonus(frameIndex)
         frameIndex += 2
       } else {
-        score += this.sumOfBallsInFrame(frameIndex)
+        false
         frameIndex += 2
       }

[Killed] ConditionalExpression
Documentos/scoringBowling/src/game.ts:17:9
         frameIndex += 2
       } else {
         score += this.sumOfBallsInFrame(frameIndex)
-        frameIndex += 2
+        false
       }
     }

[Timeout] ConditionalExpression
Documentos/scoringBowling/src/game.ts:17:9
         frameIndex += 2
       } else {
         score += this.sumOfBallsInFrame(frameIndex)
-        frameIndex += 2
+        true
       }
     }

[Timeout] BlockStatement
Documentos/scoringBowling/src/game.ts:23:58
     return score
   }
 
-  private sumOfBallsInFrame (frameIndex: number): number {
-    return this.rolls[frameIndex] + this.rolls[frameIndex + 1]
-  }
+  private sumOfBallsInFrame (frameIndex: number): number {}
 
   private strikeBonus (frameIndex: number): number {

[Killed] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:24:59
   }
 
   private sumOfBallsInFrame (frameIndex: number): number {
-    return this.rolls[frameIndex] + this.rolls[frameIndex + 1]
+    return this.rolls[frameIndex] + this.rolls[frameIndex - 1]
   }
 

[Timeout] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:24:35
   }
 
   private sumOfBallsInFrame (frameIndex: number): number {
-    return this.rolls[frameIndex] + this.rolls[frameIndex + 1]
+    return this.rolls[frameIndex] - this.rolls[frameIndex + 1]
   }
 

[Timeout] BlockStatement
Documentos/scoringBowling/src/game.ts:27:52
     return this.rolls[frameIndex] + this.rolls[frameIndex + 1]
   }
 
-  private strikeBonus (frameIndex: number): number {
-    return this.rolls[frameIndex + 1] +
-           this.rolls[frameIndex + 2]
-  }
+  private strikeBonus (frameIndex: number): number {}
 
   private spareBonus (frameIndex: number): number {

[Timeout] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:28:39
   }
 
   private strikeBonus (frameIndex: number): number {
-    return this.rolls[frameIndex + 1] +
+    return this.rolls[frameIndex + 1] -
            this.rolls[frameIndex + 2]
   }

[Timeout] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:28:34
   }
 
   private strikeBonus (frameIndex: number): number {
-    return this.rolls[frameIndex + 1] +
+    return this.rolls[frameIndex - 1] +
            this.rolls[frameIndex + 2]
   }

[Timeout] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:29:34
 
   private strikeBonus (frameIndex: number): number {
     return this.rolls[frameIndex + 1] +
-           this.rolls[frameIndex + 2]
+           this.rolls[frameIndex - 2]
   }
 

[Timeout] BlockStatement
Documentos/scoringBowling/src/game.ts:32:51
            this.rolls[frameIndex + 2]
   }
 
-  private spareBonus (frameIndex: number): number {
-    return this.rolls[frameIndex + 2]
-  }
+  private spareBonus (frameIndex: number): number {}
 
   private isStrike (frameIndex: number): boolean {

[Timeout] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:33:34
   }
 
   private spareBonus (frameIndex: number): number {
-    return this.rolls[frameIndex + 2]
+    return this.rolls[frameIndex - 2]
   }
 

[Timeout] BlockStatement
Documentos/scoringBowling/src/game.ts:36:50
     return this.rolls[frameIndex + 2]
   }
 
-  private isStrike (frameIndex: number): boolean {
-    return this.rolls[frameIndex] === 10
-  }
+  private isStrike (frameIndex: number): boolean {}
 
   private isSpare (frameIndex: number): boolean {

[Timeout] ConditionalExpression
Documentos/scoringBowling/src/game.ts:37:12
   }
 
   private isStrike (frameIndex: number): boolean {
-    return this.rolls[frameIndex] === 10
+    return false
   }
 

[Timeout] ConditionalExpression
Documentos/scoringBowling/src/game.ts:37:12
   }
 
   private isStrike (frameIndex: number): boolean {
-    return this.rolls[frameIndex] === 10
+    return true
   }
 

[Timeout] BlockStatement
Documentos/scoringBowling/src/game.ts:40:49
     return this.rolls[frameIndex] === 10
   }
 
-  private isSpare (frameIndex: number): boolean {
-    return this.rolls[frameIndex] + this.rolls[frameIndex + 1] === 10
-  }
+  private isSpare (frameIndex: number): boolean {}
 
   roll (pins: number): void {

[Timeout] EqualityOperator
Documentos/scoringBowling/src/game.ts:41:64
   }
 
   private isSpare (frameIndex: number): boolean {
-    return this.rolls[frameIndex] + this.rolls[frameIndex + 1] === 10
+    return this.rolls[frameIndex] + this.rolls[frameIndex + 1] !== 10
   }
 

[Timeout] ArithmeticOperator
Documentos/scoringBowling/src/game.ts:41:35
   }
 
   private isSpare (frameIndex: number): boolean {
-    return this.rolls[frameIndex] + this.rolls[frameIndex + 1] === 10
+    return this.rolls[frameIndex] - this.rolls[frameIndex + 1] === 10
   }
 

[Timeout] BlockStatement
Documentos/scoringBowling/src/game.ts:44:29
     return this.rolls[frameIndex] + this.rolls[frameIndex + 1] === 10
   }
 
-  roll (pins: number): void {
-    this.rolls[this.currentRoll++] = pins
-  }
+  roll (pins: number): void {}
 }
 

[Timeout] UpdateOperator
Documentos/scoringBowling/src/game.ts:45:16
   }
 
   roll (pins: number): void {
-    this.rolls[this.currentRoll++] = pins
+    this.rolls[this.currentRoll--] = pins
   }
 }
